/*
VirtualKeyboard.addLayout('AL','Albanian',
'\\1234567890-=]qwertzuiopç@asdfghjklë[yxcvbnm,./'
,{0:'|!"#$%^&*()_+}',25:'\'',36:'{',44:';:?'},{1:'~ˇ^˘°˛`˙´˝¨¸¤\\|',24:'÷×',27:'đĐ[]',33:'łŁ$ß',40:'@{}§<>'},'ˇ^˘°˛˙´˝¨¸');
VirtualKeyboard.addLayout('SA','Arabic (101)',
'ذ1234567890-=\\ضصثقفغعهخحجدشسيبلاتنمكطئءؤرلاىةوزظ'
,{0:'ّ!@#$%^&*)(_+|ًٌَُلإإ‘÷×؛<>ٍِ][لأأـ،/:"~ْ}{لآآ’,.؟'});
VirtualKeyboard.addLayout('SA','Arabic (102) AZERTY',
'>&é"\'(-è_çà)=ذضصثقفغعهخحجدشسيبلاتنمكطئءؤرلاىةوزظ'
,{0:'<123456789°+ًٌَُّلإإ‘÷×؛}{\\',28:'][لأأـ،/:"~ٍِْلآآ’,.؟'},{4:'¤',14:'َّًّُّٌّ',39:'ِّٍّ'});
VirtualKeyboard.addLayout('IQ','Arabic',
'ذ1234567890-=\\ضصثقفغعهخحجدشسيبلاتنمكطئءؤرﻻىةورظ'
,{0:'ّ!@#$%^&*)(_+|ًٌَُﻹإ‘÷×؛<>ٍِ[]ﻷأـ،/:"~ْ{}ﻵآ’,.؟'});
VirtualKeyboard.addLayout('AM','Armenian Eastern',
'՝:ձյ՛,-.«»օռժ\'խւէրտեըիոպչջասդֆքհճկլթփզցգվբնմշղծ'
,{0:'՜1',4:'349և()',13:'՞'});
VirtualKeyboard.addLayout('AM','Armenian Western',
'՝:ձյ՛,-.«»օռժ\'խվէրդեըիոբչջաստֆկհճքլթփզցգւպնմշղծ'
,{0:'՜1',4:'349և()',13:'՞'});
VirtualKeyboard.addLayout('AZ','Azeri Cyrillic',
'`1234567890-=\\јүукенгшһзхҹфывапролджҝәчсмитғбө.'
,{0:'~!"№;%:?*()_+/',46:','});
VirtualKeyboard.addLayout('AZ','Azeri Latin',
'`1234567890-=\\qüertyuiopöğasdfghjklıəzxcvbnmçş.'
,{0:'~!"Ⅶ;%:?*()_+/',21:'İ',46:','});
VirtualKeyboard.addLayout('AZ','Azeri Cyrillic',
'`1234567890-=\\јүукенгшһзхҹфывапролджҝәчсмитғбө.'
,{0:'~!"№;%:?*()_+/',46:','});
VirtualKeyboard.addLayout('BY','Belarusian',
'ё1234567890-=\\йцукенгшўзх\'фывапролджэячсмітьбю.'
,{1:'!"№;%:?*()_+/',46:','});
VirtualKeyboard.addLayout('BE','Belgian (Comma)',
'²&é"\'(§è!çà)-µazertyuiop^$qsdfghjklmùwxcvbn,;:='
,{0:'³123456789°_£',24:'¨*',36:'%',43:'?./+'},{1:'|@#{[^',9:'{}',13:'`',16:'€',24:'[]',36:'´',46:'~'},'`^´~');
VirtualKeyboard.addLayout('BE','Belgian French',
'²&é"\'(§è!çà)-µazertyuiop^$qsdfghjklmùwxcvbn,;:='
,{0:'³123456789°_£',24:'¨*',36:'%',43:'?./+'},{1:'|@#{[^',9:'{}',13:'`',16:'€',24:'[]',36:'´',46:'~'},'`^´~');
VirtualKeyboard.addLayout('BE','Belgian (Period)',
'²&é"\'(§è!çà)-µazertyuiop^$qsdfghjklmùwxcvbn,;:='
,{0:'³123456789°_£',24:'¨*',36:'%',43:'?./+'},{1:'|@#{[^',9:'{}',13:'`',16:'€',24:'[]',36:'´',46:'~'},'`^´~');
VirtualKeyboard.addLayout('BA','Bosnian',
'¸1234567890\'+žqwertzuiopšđasdfghjklčćyxcvbnm,.-'
,{0:'¨!"#$%&/()=?*',44:';:_'},{1:'~ˇ^˘°˛`˙´˝¨¸¤\\|€',24:'÷×',29:'[]',33:'łŁ',36:'ß',40:'@{}§<>'},'¸¨ˇ^˘°˛˙´˝¨¸');
VirtualKeyboard.addLayout('BG','Bulgarian (Latin)',
'`1234567890-=\\qwertyuiop[]asdfghjkl;\'zxcvbnm,./'
,{0:'~!@#$%^&*()_+|',24:'{}',35:':"',44:'<>?'});
VirtualKeyboard.addLayout('BG','Bulgarian',
'`1234567890-.(,уеишщксдзц;ьяаожгтнвмчюйъэфхпрлб'
,{0:'~!?+"%=:/_№ІV)ы',25:'§'});
VirtualKeyboard.addLayout('CA','Canadian French (Legacy)',
'°1234567890-=àqwertyuiop^çasdfghjkl;èzxcvbnm,.é'
,{1:'!"#$%?&*()_+',35:':',44:'\''},{0:'¬¹@³¼½¾{[]}|¸`',17:'¶',19:'¥',22:'øþ°~æßðª',35:'´',37:'«»¢',43:'µ<>/'},'¸`^~´');
VirtualKeyboard.addLayout('CA','Canadian French',
'#1234567890-=<qwertyuiop^¸asdfghjkl;`zxcvbnm,.é'
,{0:'|!"/$%?&*()_+>',25:'¨',35:':',44:'\''},{0:'\\±@£¢¤¬¦²³¼½¾}',22:'§¶[]',35:'~{',43:'µ¯\u00AD´'},'^^¸`´');
VirtualKeyboard.addLayout('CA','Canadian Multilingual Standard',
'/1234567890-=àqwertyuiop^çasdfghjkl;èzxcvbnm,.é'
,{0:'\\!@#$%?&*()_+',24:'¨',35:':',44:'\'"'},{0:'|',4:'¤',7:'{}[]',12:'¬',16:'€',24:'`~',35:'°',37:'«»',44:'<>'},'^¨`~');
VirtualKeyboard.addLayout('HR','Croatian',
'¸1234567890\'+žqwertzuiopšđasdfghjklčćyxcvbnm,.-'
,{0:'¨!"#$%&/()=?*',44:';:_'},{1:'~ˇ^˘°˛`˙´˝¨¸¤\\|€',24:'÷×',29:'[]',33:'łŁ',36:'ß',40:'@{}§<>'},'¸¨ˇ^˘°˛˙´˝¨¸');
VirtualKeyboard.addLayout('CZ','Czech Programmers',
'`1234567890-=\\qwertyuiop[]asdfghjkl;\'zxcvbnm,./'
,{0:'~!@#$%^&*()_+|',24:'{}',35:':"',44:'<>?'},{0:';+ěščřžýáíé=´¨',16:'€',24:'ú)',35:'ů§',44:'?:-'},'´¨');
VirtualKeyboard.addLayout('CZ','Czech (QWERTY)',
's+ěĚšŠčČřŘžŽýdÝáÁíÍéÉ=´qwertyuiopúÚ)afghjklůŮ§;'
,{1:'1234567',14:'89%ˇ',33:'/(',43:'"!°'},{1:'!@#$%^&',14:'*()-=',25:'€',33:'[]',43:';¤`'},'´ˇ°');
VirtualKeyboard.addLayout('CZ','Czech',
's+ěĚšŠčČřŘžŽýdÝáÁíÍéÉ=´qwertzuiopúÚ)afghjklůŮ§;'
,{1:'1234567',14:'89%ˇ',33:'/(',43:'"!°'},{0:'đ~ˇ^˘°˛`Đ˙´˝¨¸\\|€',33:'÷×',37:'[]',41:'łŁ$ß'},'ˇ^˘°˛`˙´˝¨°');
VirtualKeyboard.addLayout('DK','Danish',
'½1234567890+´\'qwertyuiopå¨asdfghjklæøzxcvbnm,.-'
,{0:'§!"#¤%&/()=?`*',25:'^',44:';:_'},{2:'@£$€',7:'{[]}',12:'|',16:'€',25:'~',43:'µ'},'´`¨');
VirtualKeyboard.addLayout('IN','Devanagari',
'ॊ1234567890-ृॉौैाीूबहगदजड़ोे्िुपरकतचटॆंमनवलस,.य'
,{0:'ऒऍॅ्रर्ज्ञत्रक्षश्र()ःऋऑऔऐआईऊभङघधझढञओएअइउफऱखथछठऎँणऩऴळशष।य़'},{1:'१२३४५६७८९०',12:'ॄ',17:'ॣ',21:'ग़',23:'ज़ड़',29:'ॢ',33:'क़',35:'॒',37:'॓',39:'॔',44:'॰॥'});
VirtualKeyboard.addLayout('MV','Divehi Phonetic',
'`1234567890-=\\ްއެރތޔުިޮޕ][ަސދފގހޖކލ؛\'ޒ×ޗވބނމ،./'
,{0:'~!@#$%^&*)(_+|ޤޢޭޜޓޠޫީޯ÷}{ާށޑﷲޣޙޛޚޅ:"ޡޘޝޥޞޏޟ><؟'},{35:';',40:'\u200D\u200C\u200E\u200F,'});
VirtualKeyboard.addLayout('MV','Divehi Typewriter',
'`1234567890-=]ޫޮާީޭގރމތހލ[ިުްަެވއނކފﷲޒޑސޔޅދބށޓޯ'
,{0:'~!@#$%^&*)(_+}×’“/:ޤޜޣޠޙ÷{<>.،"ޥޢޘޚޡ؛ޖޕޏޗޟޛޝ\\ޞ؟'},{29:',',36:';',40:'\u200D\u200C\u200E\u200F'});
VirtualKeyboard.addLayout('NL','Dutch',
'@1234567890/°<qwertyuiop¨*asdfghjkl+´zxcvbnm,.-'
,{0:'§!"#$%&_()\'?~>',24:'^|',35:'±`',44:';:='},{0:'¬¹²³¼½¾£{}',11:'\\¸',16:'€¶',27:'ß',37:'«»¢',43:'µ',45:'·'},'~¸¨´');
*/
VirtualKeyboard.addLayout('BT','Dzongkha',
'༛༡1༢2༣3༤4༥5༦6ེ༧7༨8༩9༠0༔-།=ཀྈཁྉག࿇ངིྃ༚ུ༜ོ༝ཅ༞ཆ༟ཇ[ཉ'
,{0:'༄!༅@༆#',8:'$',10:'%༈༁ཻ༸&༴*༼(༽)ཿ_༑+ྐྑྒྔ྄ྀཽྂ༗ྕ༘ྖ༙ྗ༾ྙ'},{0:'123456༜789-=ྈྉ',31:'ྃ༚༛༝༞༟[]'});
/*
VirtualKeyboard.addLayout('EE','Estonian',
'ˇ1234567890+´\'qwertyuiopüõasdfghjklöäzxcvbnm,.-'
,{0:'~!"#¤%&/()=?`*',44:';:_'},{2:'@£$€',7:'{[]}\\',13:'½',16:'€',25:'§',27:'š',36:'^ž'},'ˇ~´^');
VirtualKeyboard.addLayout('FO','Faeroese',
'½1234567890+´\'qwertyuiopåðasdfghjklæøzxcvbnm,.-'
,{0:'§!"#¤%&/()=?`*',44:';:_'},{2:'@£$€',7:'{[]}',12:'|',16:'€',24:'¨~',36:'^',43:'µ'},'´`¨~^');
VirtualKeyboard.addLayout('IR','Farsi',
'÷1234567890-=پضصثقفغعهخحجچشسیبلاتنمکگظطزرذدئو./'
,{0:'×!@#$%^&*)(_+|ًٌٍريال،؛,][\\}{َُِّۀآـ«»:"ةيژؤإأء<>؟'});
VirtualKeyboard.addLayout('SE','Finnish with Sami',
'§1234567890+´\'qwertyuiopå¨asdfghjklöäzxcvbnm,.-'
,{0:'½!"#¤%&/()=?`*',25:'^',44:';:_'},{2:'@£$€',7:'{[]}\\',14:'â',16:'€',18:'ŧ',21:'ïõ',25:'~ášđǥǧȟ',33:'ǩ',35:'øæž',39:'čǯʒŋµ'},'´`¨');
VirtualKeyboard.addLayout('FI','Finnish',
'§1234567890+´\'qwertyuiopå¨asdfghjklöäzxcvbnm,.-'
,{0:'½!"#¤%&/()=?`*',25:'^',44:';:_'},{2:'@£$€',7:'{[]}\\',16:'€',25:'~',43:'µ'},'´`¨');
VirtualKeyboard.addLayout('FR','French',
'²&é"\'(-è_çà)=*azertyuiop^$qsdfghjklmùwxcvbn,;:!'
,{1:'123456789°+µ',24:'¨£',36:'%',43:'?./§'},{2:'~#{[|`\\^@]}',16:'€',25:'¤'},'~`^');
VirtualKeyboard.addLayout('MK','FYRO Macedonian',
'`1234567890-=жљњертѕуиопшѓасдфгхјклчќзџцвбнм,./'
,{0:'~!„“’%‘&*()_+',44:';:?'},{16:'€',24:'Ђђ',29:'[]',35:'Ћћ',40:'@{}§'});
VirtualKeyboard.addLayout('IE','Gaelic',
'`1234567890-=#qwertyuiop[]asdfghjkl;\'zxcvbnm,./'
,{1:'!"£$%^&*()_+~',24:'{}',35:':@',44:'<>?'},{0:'¦',4:'€',16:'é',19:'ýúíó',26:'á'},'`\'');
VirtualKeyboard.addLayout('GE','Georgian',
'„!?№§%:.;,/–=(ღჯუკენგშწზხცფძვთაპროლდჟჭჩყსმიტქბჰ'
,{0:'“123456789-+)'},{18:'ჱ',24:'ჴ',26:'ჶ',28:'ჳ',42:'ჲ',46:'ჵ'});
VirtualKeyboard.addLayout('DE','German (IBM)',
'^1234567890ß´#qwertzuiopü+asdfghjklöäyxcvbnm,.-'
,{0:'°!"§$%&/()=?`\'',25:'*',44:';:_'},{2:'²³',7:'{[]}\\',14:'@',16:'€',25:'~',43:'µ'},'^´');
VirtualKeyboard.addLayout('DE','German',
'^1234567890ß´#qwertzuiopü+asdfghjklöäyxcvbnm,.-'
,{0:'°!"§$%&/()=?`\'',25:'*',44:';:_'},{2:'²³',7:'{[]}\\',14:'@',16:'€',25:'~',43:'µ'},'^´');
VirtualKeyboard.addLayout('GR','Greek (220) Latin',
'\\1234567890\']#qwertyuiop+}asdfghjkl΄¨zxcvbnm,.-'
,{0:'|!"#$%&/()=?[@',24:'*{',35:'¨΅',44:';:_'},{2:'²³£§¶',8:'¤¦°±½¬',16:'€',24:'«»',35:'΅΅'},'΄¨΅');
VirtualKeyboard.addLayout('GR','Greek (220)',
'½1234567890\']#;ςερτυθιοπ+}ασδφγηξκλ΄¨ζχψωβνμ,.-'
,{0:'±!"£$%&/()=?[@:~',24:'*{',35:'¨΅',44:';:_'},{2:'²³£§¶',8:'¤¦°±½¬',16:'€®',19:'¥',24:'«»',35:'΅΅',39:'©'},'΄¨΅');
VirtualKeyboard.addLayout('GR','Greek (319) Latin',
'\\1234567890\'+`qwertyuiop[]asdfghjkl´^zxcvbnm,.-'
,{0:'|!"#$%&/()=?*@',24:'{}',35:'¨~',44:';:_'},{16:'€'},'`´^');
VirtualKeyboard.addLayout('GR','Greek (319)',
'½1234567890\'+²·ςερτυθιοπ[]ασδφγηξκλ΄’ζχψωβνμ,.-'
,{0:'±!"£$%¬/()=°*³―¦',24:'«»',35:'¨‘',44:';:_'},{16:'€',35:'΅'},'΄¨΅');
VirtualKeyboard.addLayout('GR','Greek Latin',
'`1234567890-=\\qwertyuiop[]asdfghjkl;\'zxcvbnm,./'
,{0:'~!@#$%^&*()_+|',24:'{}',35:':"',44:'<>?'},{1:'¡²³¤€¼½¾‘’¥×¬äåé®þüúíóö«»áßð',34:'ø¶´æ',39:'©',42:'ñµç',46:'¿'},'`~^´');
VirtualKeyboard.addLayout('GR','Greek Polytonic',
'~1234567890-=\\;ςερτυθιοπ[]ασδφγηξκλ΄\'ζχψωβνμ,./'
,{0:'`!@#$%^&*()_+|:΅',24:'{}',35:'¨"',44:'<>?'},{0:'῁ϚϞϠ£§¶',8:'¤¦°±½¬´',16:'€®',19:'¥',24:'«»',35:'΅᾿',39:'©',46:'ι'},'~`῁-=\\;΅[]΄\'/');
VirtualKeyboard.addLayout('GR','Greek',
'`1234567890-=\\;ςερτυθιοπ[]ασδφγηξκλ΄\'ζχψωβνμ,./'
,{0:'~!@#$%^&*()_+|:΅',24:'{}',35:'¨"',44:'<>?'},{2:'²³£§¶',8:'¤¦°±½¬',16:'€®',19:'¥',24:'«»',35:'΅',39:'©'},'΅΄');
VirtualKeyboard.addLayout('IN','Gujarati',
'ૉ1234567890-ૃંૌૈાીૂબહગદજડ઼ોે્િુપરકતચટમનવલસ,.ય .'
,{0:'ઑઍૅ્રર્જ્ઞત્રક્ષશ્ર()ઃઋઁઔઐઆઈઊભઙઘધઝઢઞઓએઅઇઉફ',33:'ખથછઠણ',40:'ળશષ।'},{1:'૧૨૩૪૫૬૭૮૯૦',12:'ૄ',43:'॥'});
VirtualKeyboard.addLayout('IL','Hebrew',
';1234567890+-\\/\'קראטוןםפ][שדגכעיחלךף,זסבהנמצתץ.'
,{0:'~!@#$%^&*()-=|qwertyuiop}{asdfghjkl:"zxcvbnm<>?'});
VirtualKeyboard.addLayout('IN','Hindi Traditional',
'1234567890-ृॉौैाीूबहगदजड़ोे्िुपरकतचटंमनवलस,.य '
,{1:'ऍॅ्रर्ज्ञत्रक्षश्र()ःऋऑऔऐआईऊभङघधझढञओएअइउफऱखथछठँण',41:'ळशष।य़'},{0:'`१२३४५६७८९०',12:'=\\',24:'[]',35:';\'',45:'/'});
VirtualKeyboard.addLayout('HU','Hungarian 101-key',
'í123456789öüóűqwertyuiopőúasdfghjkléázxcvbnm,.-'
,{1:'\'"+!%/=()',44:'?:_'},{0:'~ˇ^˘°˛`˙´˝',13:'\\\\|Ä§¤',20:'€Í',24:'÷×äđĐ[]',32:'íłŁ$ß>#&@{}<;>*'});
VirtualKeyboard.addLayout('HU','Hungarian',
'0123456789öüóűqwertzuiopőúasdfghjkléáyxcvbnm,.-'
,{0:'§\'"+!%/=()',44:'?:_'},{1:'~ˇ^˘°˛`˙´˝¨¸¤\\|Ä',20:'€Í',24:'÷×äđĐ[]',32:'íłŁ$ß>#&@{}<;>*'},'ˇ^˘°˛˙´˝¨¸');
VirtualKeyboard.addLayout('IS','Icelandic',
'°1234567890ö-+qwertyuiopð\'asdfghjklæ´zxcvbnm,.þ'
,{0:'¨!"#$%&/()=',12:'_*',25:'?',36:'\'',44:';:'},{5:'€',7:'{[]}\\',13:'`@',16:'€',25:'~',36:'^',43:'µ'},'°¨`´');
VirtualKeyboard.addLayout('IE','Irish',
'`1234567890-=#qwertyuiop[]asdfghjkl;\'zxcvbnm,./'
,{0:'¬!"£$%^&*()_+~',24:'{}',35:':@',44:'<>?'},{0:'¦',4:'€',16:'é',20:'úíó',26:'á',36:'´'},'`´');
VirtualKeyboard.addLayout('IT','Italian (142)',
'\\1234567890\'ìùqwertyuiopè+asdfghjklòàzxcvbnm,.-'
,{0:'|!"£$%&/()=?^§',24:'é*',35:'ç°',44:';:_'},{3:'#',5:'€',7:'{[]}',13:'`@',16:'€',25:'~'});
VirtualKeyboard.addLayout('IT','Italian',
'\\1234567890\'ìùqwertyuiopè+asdfghjklòàzxcvbnm,.-'
,{0:'|!"£$%&/()=?^§',24:'é*',35:'ç°',44:';:_'},{5:'€',16:'€',24:'[]',35:'@#'});
VirtualKeyboard.addLayout('IN','Kannada',
'ೊ1234567890-ೃೆೌೈಾೀೂಬಹಗದಜಡೋೇ್ಿುಪರಕತಚಟಂಮನವಲಸ,.ಯ '
,{0:'ಒ',3:'್ರರ್ಜ್ಞತ್ರಕ್ಷಶ್ರ()ಃಋಎಔಐಆಈಊಭಙಘಧಝಢಞಓಏಅಇಉಫಱಖಥಛಠ',38:'ಣ',41:'ಳಶಷ|'},{1:'೧೨೩೪೫೬೭೮೯೦',12:'ೄ',15:'ೖ',27:'ೕ'});
VirtualKeyboard.addLayout('KZ','Kazakh',
'("әіңғ,.үұқөһ\\йцукенгшщзхъфывапролджэячсмитьбю№'
,{0:')!',6:';:',13:'/',46:'?'});
var Korean={
Jamo: {
// bits: 1: vowel, 2:
'\u3131':[14,44032,1], //g
'\u3132':[6,44620,2], //gg
'\u3133':[4,-1,3], //gs
'\u3134':[14,45208,4], //n
'\u3135':[4,-1,5], //nj
'\u3136':[4,-1,6], //nh
'\u3137':[6,45796,7], //d
'\u3138':[2,46384,0], //dd
'\u3139':[14,46972,8], //r
'\u313a':[4,-1,9], //lg
'\u313b':[4,-1,10], //lm
'\u313c':[4,-1,11], //lb
'\u313d':[4,-1,12], //ls
'\u313e':[4,-1,13], //lt
'\u313f':[4,-1,14], //lp
'\u3140':[4,-1,15], //lh
'\u3141':[6,47560,16], //m
'\u3142':[14,48148,17], //b
'\u3143':[2,48736,0], //bb
'\u3144':[4,-1,18], //bs
'\u3145':[14,49324,19], //s
'\u3146':[6,49912,20], //ss
'\u3147':[6,50500,21], //ng
'\u3148':[6,51088,22], //j
'\u3149':[2,51676,0], //jj
'\u314a':[6,52264,23], //ch
'\u314b':[6,52852,24], //k
'\u314c':[6,53440,25], //t
'\u314d':[6,54028,26], //p
'\u314e':[6,54616,27], //h
'\u314f':[1,0,0], //a
'\u3150':[1,28,0], //ae
'\u3151':[1,56,0], //ya
'\u3152':[1,84,0], //yae
'\u3153':[1,112,0], //eo
'\u3154':[1,140,0], //e
'\u3155':[1,168,0], //yeo
'\u3156':[1,196,0], //ye
'\u3157':[1,224,0], //o
'\u315b':[1,336,0], //yo
'\u315c':[1,364,0], //u
'\u3160':[1,476,0], //yu ?
'\u3161':[1,504,0], //eu
'\u3163':[1,560,0] //i
},
VV2V:[0,0,0,0,0,0,0,0,0,224,224,224,0,0,364,364,364,0,0,504,0],
V2VV:[0,0,0,0,0,0,0,0,{'\u314f':252,'\u3150':280,'\u3163':308},0,0,0,0,{'\u3153':392,'\u3154':420,'\u3163':448},0,0,0,0, {'\u3163':532},0,0],
CV2C: ['\u3131','\u3132','\u3134','\u3137','\u3138','\u3139','\u3141','\u3142','\u3143','\u3145','\u3146','\u3147','\u3148','\u3149','\u314a','\u314b','\u314c','\u314d','\u314e'],
C2CC: {'\u3131':'\u3132','\u3137':'\u3138','\u3142':'\u3143','\u3145':'\u3146','\u3148':'\u3149'},
CC2C: {'\u3132':'\u3131','\u3138':'\u3137','\u3143':'\u3142','\u3146':'\u3145','\u3149':'\u3148'},
PP2P:[0,0,1,1,0,4,4,0,0,8,8,8,8,8,8,8,0,0,17,0,19,0,0,0,0,0,0,0],
PP2PC:[0,
[0,44032],//g
[0,44620],//gg
[1,49324],//gs
[0,45208],//n
[4,51088],//nj
[4,54616],//nh
[0,45796],//d
[0,46972],//r
[8,44032],//lg
[8,47560],//lm
[8,48148],//lb
[8,49324],//ls
[8,53440],//lt
[8,54028],//lp
[8,54616],//lh
[0,47560],//m
[0,48148],//b
[17,49324],// bs
[0,49324],//s
[0,49912],//ss
[0,50500],//ng
[0,51088],//j
[0,52264],//ch
[0,52852],//k
[0,53440],//t
[0,54028],//p
[0,54616]//h
],

P2PP:[0,{'\u3131':2, '\u3145':3}, //g
0,0,{'\u3148':5, '\u314e':6}, //n
0,0,0,{'\u3131':9, '\u3141':10, '\u3142':11, '\u3145':12, '\u314c':13, '\u314d':14, '\u314e':15}, //r
0,0,0,0,0,0,0, // l*
0,{'\u3145':18}, //b
0, {'\u3145':20}, //s
0,0,0,0,0,0,0,0],

Ru2Kor:{'-':'-',
'\u0430': '\u314f',     '\u0410': '\u314f',//a
'\u0431': '\u3142',     '\u0411': '\u3143',     //b, PP
'\u0432': '\u3157',     '\u0412': '\u3157',     //v
'\u0433': '\u3131',     '\u0413': '\u3132',     //g,G
'\u0434': '\u3137',     '\u0414': '\u3138',     //d,TT
'\u0435': '\u3154',     '\u0415': '\u3154',     //e
'\u0451': '\u315b',     '\u0401': '\u3155',     //yo, Yo
'\u0436': '\u3148',     '\u0416': '\u3148',     //zh
'\u0437': '\u3148',     '\u0417': '\u3148',     //z
'\u0438': '\u3163',     '\u0418': '\u3163',     //i
'\u0439': '\u3163',     '\u0419': '\u3163',     //y
'\u043a': '\u3131',     '\u041a': '\u3132',     //k, K
'\u043b': '\u3139',     '\u041b': '\u3139',     //l
'\u043c': '\u3141',     '\u041c': '\u3141',     //m
'\u043d': '\u3134',     '\u041d': '\u3147',     //n, N=ng
'\u043e': '\u3157',     '\u041e': '\u3153',     //o, O
'\u043f': '\u3142',     '\u041f': '\u3143',     //p, PP
'\u0440': '\u3139',     '\u0420': '\u3139',     //r
'\u0441': '\u3145',     '\u0421': '\u3146',     //s, SS
'\u0442': '\u3137',     '\u0422': '\u3138',     //t, TT
'\u0443': '\u315c',     '\u0423': '\u315c',     //u
'\u0444': '\u314d',     '\u0424': '\u314d',     //f
'\u0445': '\u314e',     '\u0425': '\u314e',     //x
'\u0446': '\u3149',     '\u0426': '\u3149',     //ts
'\u0447': '\u3148',     '\u0427': '\u3149',     //ch, JJ
'\u0448': '\u3145',     '\u0428': '\u3145',     //sh
'\u0449': '\u3145',     '\u0429': '\u3145',     //shch
'\u044a': '\u044a',     
'\u044b': '\u3161',     '\u042b': '\u3161',     //eu
'\u044c': '\u3153',     '\u042c': '\u3153',     // soft sign
'\u044d': '\u3150',     '\u042d': '\u3150',     //ae
'\u044e': '\u3160',     '\u042e': '\u3160',     //yu
'\u044f': '\u3151', '\u042f': '\u3151'//ya
},
RuVowels:         "\u044c\u042c\u0410\u0430\u0415\u0435\u0401\u0451\u0418\u0438\u0419\u0439\u041e\u043e\u0423\u0443\u042b\u044b\u042d\u044d\u042e\u044e\u042f\u044f",
Ru2KorJotVowels:  "\u3155\u3155\u3151\u3151\u3156\u3156\u3155\u315b\u3163\u3163\u3163\u3163\u3155\u315b\u3160\u3160\u3161\u3161\u3152\u3152\u3160\u3160\u3151\u3151",
flags:0 //for some crosstalk
/*
1 -sh
2 -jot
4 -w
8 -
16 -
/*
}
function parseHangul(bufchar){
        if(bufchar=='' || bufchar.length>1) return null
  var code=bufchar.charCodeAt()
        if(code<0x3131 || code >0xD7A3) return null // non Korean buffer
  else if(code<0x314F && code>0x3130) return [Korean.Jamo[bufchar][1],-1,0] // consonant in buffer
        code -= 44032
        var arr=[]
        arr[0]=44032+588*(code / 588 >>0)
        code %= 588
        arr[1]= 28*(code / 28 >>0)
        arr[2]= code % 28
        return arr
}

function KoreanCharProcessor(chr, buf, CVC, rukbd){
        var jamo=Korean.Jamo[chr]
  if(!CVC) CVC=parseHangul(buf)
      if(CVC==null){
                if(!jamo)       return [chr,0]
                else{
                        if(jamo[0] & 2) return [chr,1] //can start a syllable
                        else return [chr,0]
                }
        }else{ // full buf
                if(chr=='\u0008'){
                        if(CVC[2]) return [ String.fromCharCode( CVC[0]+CVC[1]+Korean.PP2P[CVC[2]]), 1]
                        else if(CVC[1]>-1){
                                var VV2V=Korean.VV2V[CVC[1]/28]
                                if(VV2V) return [String.fromCharCode(CVC[0]+VV2V), 1]
                                else return [Korean.CV2C[(CVC[0]-44032)/588], 1]
                        }
                        else if(Korean.CC2C[buf])return [Korean.CC2C[buf],1]
                        else{
                                Korean.flags=0
                                 return['',0] 
                        }
                }else if(!jamo){
                        Korean.flags=0
                  return [buf+chr,0]
                }else if(CVC[2]){ // [CVC]
                        if(jamo[0] & 2) { //[CVC] +C
                                var P2PP = Korean.P2PP[CVC[2]][chr]    
                                if(P2PP) return [ String.fromCharCode( CVC[0]+CVC[1]+P2PP), 1] // [CVCC]
                                else return [buf+chr, 1] // CVC, [C]
                        }else if(jamo[0] & 1){// [CVC] +V
                                        if(rukbd && CVC[2]==21) return [buf+String.fromCharCode(50500+jamo[1]),1]
                                 return [String.fromCharCode( CVC[0]+CVC[1]+Korean.PP2PC[CVC[2]][0])+
                                 String.fromCharCode( Korean.PP2PC[CVC[2]][1]+Korean.Jamo[chr][1]),
                                 1] // CV(P) [PV]
                        }else{ // [CVC] + PP
                                return [buf+chr, 0]
                        }
                }else if(CVC[1]>-1){ // [CV]
                                Korean.flags &=~ 3
                        if(jamo[0] & 4) // [CV] +P
                                return [String.fromCharCode(CVC[0]+CVC[1]+jamo[2]), 1] // [CVC]
                        else if(jamo[0] & 1){ // [CV]+V
                                     if(rukbd){
                                                var vow
                                                if(Korean.flags & 4 && (vow='\u3153\u3154\u3163'.indexOf(chr))!=-1){//weo, we, wi
                                                        Korean.flags &=~4
                                                        return [String.fromCharCode(CVC[0]+[392,308,448][vow]),1]
                                                }
                                }
                                var V2VV = Korean.V2VV[CVC[1]/28][chr]
                                if(V2VV) {// [CVV]
                                        //Korean.flags &=~7
                                        return [String.fromCharCode(CVC[0]+V2VV), 1] 
                                }else {// CV,[V]
                                        if(rukbd){
                                                        //Korean.flags &=~7
                                                        return [buf+String.fromCharCode(50500+jamo[1]),1]
                                        }
                                        else return [buf+chr, 0] 
                                }
                        }
                        else return [buf+chr, 1] //CV [C]
                }
                else if(jamo[0] & 1) {// [C] +V 
                                return [String.fromCharCode(Korean.Jamo[buf][1]+jamo[1]), 1]
                }else{ //[C]+C
                                if(buf==chr && Korean.C2CC[buf]) return [Korean.C2CC[buf],1]
                                else return [buf+chr, 1]
                }
        }
}VirtualKeyboard.addLayout('KR','2 Beolsik',
'~1234567890-=\\ㅂㅈㄷㄱㅅㅛㅕㅑㅐㅔ[]ㅁㄴㅇㄹㅎㅗㅓㅏㅣ;\'ㅋㅌㅊㅍㅠㅜㅡ,./'
,{0:'`!@#$%^&*()_+|ㅃㅉㄲㄲㅆ',22:'ㅒㅖ{}',35:':"',44:'<>?'},null,KoreanCharProcessor);
VirtualKeyboard.addLayout('KR','3 Beolsik',
'~ㅎㅆㅂㅛㅠㅑㅖㅢㅜㅋ)>:ㅅㄹㅕㅐㅓㄹㄷㅁㅊㅍ(<ㅇㄴㅣㅏㅡㄴㅇㄱㅈㅂㅌㅁㄱㅔㅗㅜㅅㅎ,.ㅗ'
,{0:'`ㄲㄺㅈㄿㄾ=""\'~;+\\ㅍㅌㄵㅀㄽ56789%/ㄷㄶㄼㄻㅒ1234"ㅊㅄㅋㄳ?-"\'',46:'!'},null,KoreanCharProcessor);
VirtualKeyboard.addLayout('KR','Ru-Kor',
'ё1234567890-=\\йцукенгшщзхъфывапролджэячсмитьбю.'
,{1:'!"№;%:?*()_+/',46:','},null,function(chr, buf){
        var CVC=parseHangul(buf)
        if(CVC==null){
                var kor, jamo
                if((kor= Korean.Ru2Kor[chr]) && (jamo = Korean.Jamo[kor])){
                        var flagged='\u0448\u0428\u0439\u0419\u0432\u0412'.indexOf(chr)
                        if(flagged >=0) Korean.flags |= parseInt('112244'.charAt(flagged), 16)
                        if(jamo[0] & 1) {// V
                                return [String.fromCharCode(50500+jamo[1]),1]
                        }
                }
        }else{
                switch (chr) {
                case '-': // -
                        Korean.flags=0
                        return  [buf, 0]
                case '\u044a': // tv.znak
                                if(CVC && CVC[2] && CVC[2]==4)// n->ng
                                                return [String.fromCharCode(CVC[0]+CVC[1]+21), 1]
                                else return [buf, buf && 1 || 0]
                                break
/*              case '\u044c': //m.znak
                                return [buf, buf && 1 || 0]
                                break
*
                case '\u0445': // h
                        var pos= '\u3142\u3137\u3148\u3131'.indexOf(buf) // p t c k
                        if (pos!=-1 ) return ['\u314d\u314c\u314a\u314b'.charAt(pos), 1]
                        else if(CVC[2]) switch (CVC[2]){
                                case 1: return [String.fromCharCode(CVC[0]+CVC[1]+24), 1] // k>kh
                                case 7: return [String.fromCharCode(CVC[0]+CVC[1]+25), 1] // t>th
                                case 17: return [String.fromCharCode(CVC[0]+CVC[1]+26), 1] // p>ph
                                case 22: return [String.fromCharCode(CVC[0]+CVC[1]+23), 1] // j>ch
                                case 11: return [String.fromCharCode(CVC[0]+CVC[1]+14), 1] // lp>lph
                        }
                        break
                case '\u0436': // zh
                        if(buf=='\u3148' || buf=='\u3137') return ['\u3148', 1]
                        else if(CVC[2]){
                                if(CVC[2]==22) return [buf, 1];
                                else if (CVC[2]==7) return [String.fromCharCode(CVC[0]+CVC[1]+22), 1]
                        }
                        break
                case '\u0448': case '\u0428': // sh
                        Korean.flags =1
                        return[buf+'\u3145',1]
                        break
                case '\u0439': case '\u0419': // yot
                //debugger              
                        if(CVC[1] == -1 || CVC[2]) Korean.flags =2 //s-y, sas-y
                        break
                case '\u0432': case '\u0412': //w
                        Korean.flags =4
                        break
                default:
                if(CVC && (Korean.flags & 1 &&  CVC[1]==-1 || Korean.flags & 2 && CVC[2]==0)){//sha, rya
                                var vow
                                if((vow=Korean.RuVowels.indexOf(chr))!=-1) {//vowel
                                                Korean.flags &=~ 3
                                                return KoreanCharProcessor(Korean.Ru2KorJotVowels.charAt(vow), Korean.CV2C[(CVC[0]-44032)/588], [CVC[0],-1,0])
                                }
                        }
                }
        }
        return KoreanCharProcessor(Korean.Ru2Kor[chr]||chr, buf, CVC, 1)
});
VirtualKeyboard.addLayout('KG','Kyrgyz Cyrillic',
'ё1234567890-=\\йцукенгшщзхъфывапролджэячсмитьбю.'
,{1:'!"№;%:?*()_+/',46:','},{16:'ү',19:'ң',32:'ө'});
VirtualKeyboard.addLayout('MX','Latin American',
'|1234567890\'¿}qwertyuiop´+asdfghjklñ{zxcvbnm,.-'
,{0:'°!"#$%&/()=?¡]',24:'¨*',36:'[',44:';:_'},{0:'¬',11:'\\',13:'`@',25:'~',36:'^'},'`´^');
VirtualKeyboard.addLayout('LV','Latvian (QWERTY)',
'`1234567890-=°qwertyuiop[]asdfghjkl;\'zxcvbnm,./'
,{0:'~!@#$%^&*()_+|',24:'{}',35:':"',44:'<>?'},{0:'\u00AD «»€',6:'’',11:'–',16:'ēŗ',20:'ūīõ',26:'āš',30:'ģ',33:'ķļ',36:'´ž',39:'č',42:'ņ'},'~°´');
VirtualKeyboard.addLayout('LV','Latvian',
'\u00AD1234567890-fķūgjrmvnzēčžhšusildatec´ņbīkpoā,.ļ'
,{0:'?!«»$%/&×()_',36:'°',44:';:'},{1:'«',4:'€"’',8:':',11:'–=',14:'qģ',17:'ŗwy',24:'[]',34:'€',38:'x',40:'ķ',42:'õ',44:'<>'},'´°´');
VirtualKeyboard.addLayout('LT','Lithuanian IBM',
'`!"/;:,.?()_+|ąžertyuiopį“asdfghjklųėzūcvbnmčšę'
,{0:'~123456789-=\\',25:'”'},{7:'{[]}',16:'€'});
VirtualKeyboard.addLayout('LT','Lithuanian',
'`ąčęėįšųū90-ž\\qwertyuiop[]asdfghjkl;\'zxcvbnm,./'
,{0:'~',9:'()_',13:'|',24:'{}',35:':"',44:'<>?'},{1:'12345678',12:'=',16:'€'});
VirtualKeyboard.addLayout('IN','Malayalam',
'ൊ1234567890-ൃെൌൈാീൂബഹഗദജഡോേ്ിുപരകതചടംമനവലസ,.യ '
,{0:'ഒ',3:'്ര',7:'ക്ഷ',9:'()ഃഋഎഔഐആഈഊഭങഘധഝഢഞഓഏഅഇഉഫറഖഥഛഠ',38:'ണ',40:'ഴളശഷ'},{1:'൧൨൩൪൫൬൭൮൯൦',14:'ൗ'});
VirtualKeyboard.addLayout('MT','Maltese 47-key',
'ċ1234567890-=żqwertyuiopġħasdfghjkl;\'zxcvbnm,./'
,{1:'!@€$%^&*()_+',35:':"',44:'<>?'},{0:'`',3:'£',13:'\\',16:'è',20:'ùìò',24:'[]à'});
VirtualKeyboard.addLayout('MT','Maltese 48-key',
'ċ1234567890-=#qwertyuiopġħasdfghjkl;\'zxcvbnm,./'
,{1:'!"€$%^&*()_+~',35:':@',44:'<>?'},{0:'`',3:'£',16:'è',20:'ùìò',24:'[]à'});
VirtualKeyboard.addLayout('NZ','Maori-Dvorak (Two-Handed)',
'`1234567890[]\\\',.pyfgcrl/=aoeuidhtns-;qjkxbmwvz'
,{0:'~!@#$%^&*(){}|"<>',24:'?+',36:'_:'},null,'`');
VirtualKeyboard.addLayout('NZ','Maori',
'`1234567890-=\\qwertyuiop[]asdfghjkl;\'zxcvbnm,./'
,{0:'~!@#$%^&*()_+|',24:'{}',35:':"',44:'<>?'},null,'`');
VirtualKeyboard.addLayout('IN','Marathi',
'१२३४५६७८९०-ृॉौैाीूबहगदजड़ोे्िुपरकतचटंमनवलस,.य'
,{1:'ऍॅ्रर्ज्ञत्रक्षश्र()ःऋऑऔऐआईऊभङघधझढञओएअइउफऱखथछठ',38:'ँण',42:'ळशष।य़'},{0:'`123456789',12:'=\\',24:'[]',35:';\'',46:'/'});
VirtualKeyboard.addLayout('MN','Mongolian Cyrillic',
'=№-"₮:._,%?ещ\\фцужэнгшүзкъйыбөахролдпячёсмитьвю'
,{0:'+123456789',13:'|'});
VirtualKeyboard.addLayout('MN','Mongolian Cyrillic (QWERTY)',
'=!ыёү:;[]()шщ\\өеэртюуиопяъасдфгхжклйьзчцвбнм,./'
,{0:'+№',5:'-*&₮_=',13:'|',44:'<>?'});
VirtualKeyboard.addLayout('NO','Norwegian with Sami',
'|1234567890+\\\'qwertyuiopå¨asdfghjkløæzxcvbnm,.-'
,{0:'§!"#¤%&/()=?`*',25:'^',44:';:_'},{2:'@£$€',7:'{[]}',12:'´',14:'â',16:'€',18:'ŧ',21:'ïõ',25:'~ášđǥǧȟ',33:'ǩ',35:'öäž',39:'čǯʒŋµ'},'`´¨');
VirtualKeyboard.addLayout('NO','Norwegian',
'|1234567890+\\\'qwertyuiopå¨asdfghjkløæzxcvbnm,.-'
,{0:'§!"#¤%&/()=?`*',25:'^',44:';:_'},{2:'@£$€',7:'{[]}',12:'´',16:'€',25:'~',43:'µ'},'`´¨');
VirtualKeyboard.addLayout('PL','Polish (214)',
'˛1234567890+\'óqwertzuiopżśasdfghjklłąyxcvbnm,.-'
,{0:'·!"#¤%&/()=?*ź',24:'ńć',36:'ę',44:';:_'},{1:'~ˇ^˘°˛`·´˝¨¸',14:'\\¦',20:'€',24:'÷×',27:'đĐ',35:'$ß',40:'@{}§<>'},'˛·ˇ^˘°˛·´˝¨¸');
VirtualKeyboard.addLayout('PL','Polish (Programmers)',
'`1234567890-=\\qwertyuiop[]asdfghjkl;\'zxcvbnm,./'
,{0:'~!@#$%^&*()_+|',24:'{}',35:':"',44:'<>?'},{16:'ę',20:'€',22:'ó',26:'ąś',34:'ł',37:'żźć',42:'ń'},'~');
VirtualKeyboard.addLayout('BR','Portuguese (Brazilian ABNT2)',
'\'1234567890-=]qwertyuiop´[asdfghjklç~zxcvbnm,.;'
,{0:'"!@#$%¨&*()_+}',24:'`{',36:'^',44:'<>:'},{1:'¹²³£¢¬',12:'§º/?°',25:'ª',39:'₢'},'¨´~');
VirtualKeyboard.addLayout('BR','Portuguese (Brazilian ABNT)',
'\'1234567890-=]qwertyuiop´[asdfghjklç~zxcvbnm,.;'
,{0:'"!@#$%¨&*()_+}',24:'`{',36:'^',44:'<>:'},{1:'¹²³£¢¬',12:'§º/?°',25:'ª',39:'₢'},'¨´~');
VirtualKeyboard.addLayout('PT','Portuguese',
'\\1234567890\'«~qwertyuiop+´asdfghjklçºzxcvbnm,.-'
,{0:'|!"#$%&/()=?»^',24:'*`',36:'ª',44:';:_'},{2:'@£§€',7:'{[]}',16:'€',24:'¨]'},'~^¨´');
VirtualKeyboard.addLayout('RO','Romanian',
']1234567890+\'âqwertzuiopăîasdfghjklşţyxcvbnm,.-'
,{0:'[!"#¤%&/()=?*',44:';:_'},{1:'~ˇ^˘°˛`·´˝¨¸',14:'\\|',24:'÷×',27:'đĐ',33:'łŁ$ß',40:'@{}§<>'});
VirtualKeyboard.addLayout('RU','Russian ������',
'ю1234567890-=эяжертыуиопшщасдфгчйкл;\'зхцвбнм,./'
,{1:'!ъЪ$%ёЁ*()_+',35:':"',44:'<>?'});
VirtualKeyboard.addLayout('RU','Russian Translit',
'ё1234567890-ъэяшертыуиопющасдфгчйкльжзхцвбнм;.='
,{1:'№!/":«»?()_',44:'\',%'});
VirtualKeyboard.addLayout('RU','Russian (Typewriter)',
'|№-/":,._?%!;)йцукенгшщзхъфывапролджэячсмитьбюё'
,{0:'+123456789=\\('});
VirtualKeyboard.addLayout('RU','Russian',
'ё1234567890-=\\йцукенгшщзхъфывапролджэячсмитьбю.'
,{1:'!"№;%:?*()_+/',46:','});
VirtualKeyboard.addLayout('SE','Sami Extended Finland-Sweden',
'§1234567890+´đášertŧuiopåŋasdfghjklöäzčcvbnm,.-'
,{0:'½!"#¤%&/()=?`',44:';:_'},{0:'|',2:'@£$€',7:'{[]}\\',13:'\'qw€',19:'y',21:'ïõ',24:'¨~â',30:'ǧǥ',33:'ǩ',35:'øæʒx',43:'µ<>'},'´`¨~');
VirtualKeyboard.addLayout('NO','Sami Extended Norway',
'|1234567890+\\đášertŧuiopåŋasdfghjkløæzčcvbnm,.-'
,{0:'§!"#¤%&/()=?`',44:';:_'},{2:'@£$€',7:'{[]}',12:'´\'qw€',19:'y',21:'ïõ',24:'¨~â',30:'ǧǥ',33:'ǩ',35:'öäʒx',43:'µ<>'},'`´¨~');
VirtualKeyboard.addLayout('SP','Serbian (Cyrillic)',
'`1234567890\'+жљњертзуиопшђасдфгхјклчћѕџцвбнм,.-'
,{0:'~!"#$%&/()=?*',44:';:_'},{16:'€',44:'<>'},'\'');
VirtualKeyboard.addLayout('SP','Serbian (Latin)',
'‚1234567890\'+žqwertzuiopšđasdfghjklčćyxcvbnm,.-'
,{0:'~!"#$%&/()=?*',44:';:_'},{1:'~ˇ^˘°˛`˙´˝¨¸¤\\|€',24:'÷×',29:'[]',33:'łŁ',36:'ß',40:'@{}§<>'},'‚ˇ^˘°˛˙´˝¨¸');
VirtualKeyboard.addLayout('SK','Slovak (QWERTY)',
';+ľščťžýáíé=´ňqwertyuiopúäasdfghjklô§zxcvbnm,.-'
,{0:'°123456789%ˇ)',24:'/(',35:'"!',44:'?:_'},{1:'~ˇ^˘°˛`˙´˝¨¸¤\\|€',23:'\'÷×',27:'đĐ[]',33:'łŁ$ß>#&@{}',44:'<>*'},'°ˇ^˘°˛˙´˝¨');
VirtualKeyboard.addLayout('SK','Slovak',
';+ľščťžýáíé=´ňqwertzuiopúäasdfghjklô§yxcvbnm,.-'
,{0:'°123456789%ˇ)',24:'/(',35:'"!',44:'?:_'},{1:'~ˇ^˘°˛`˙´˝¨¸¤\\|€',23:'\'÷×',27:'đĐ[]',33:'łŁ$ß>#&@{}',44:'<>*'},'°ˇ^˘°˛˙´˝¨');
VirtualKeyboard.addLayout('SI','Slovenian',
'¸1234567890\'+žqwertzuiopšđasdfghjklčćyxcvbnm,.-'
,{0:'¨!"#$%&/()=?*',44:';:_'},{1:'~ˇ^˘°˛`˙´˝¨¸¤\\|€',24:'÷×',29:'[]',33:'łŁ',36:'ß',40:'@{}§<>'},'¸¨ˇ^˘°˛˙´˝¨¸');
VirtualKeyboard.addLayout('ES','Spanish Variation',
'\'1234567890-¨´qwertyuiop÷`asdfghjklñçzxcvbnm,.='
,{0:'·ª"/()¡!¿?₧+',24:'×',44:';:%'},{0:'\\|@#¼½¬_#§\\*~}',16:'€',24:'[]$&@[]|£±',35:'~{',45:'^'},'¨¨~´`^');
VirtualKeyboard.addLayout('ES','Spanish',
'º1234567890\'¡çqwertyuiop`+asdfghjklñ´zxcvbnm,.-'
,{0:'ª!"·$%&/()=?¿',24:'^*',36:'¨',44:';:_'},{0:'\\|@#~€¬',13:'}',16:'€',24:'[]',36:'{'},'~`´');
VirtualKeyboard.addLayout('SE','Swedish with Sami',
'§1234567890+´\'qwertyuiopå¨asdfghjklöäzxcvbnm,.-'
,{0:'½!"#¤%&/()=?`*',25:'^',44:';:_'},{2:'@£$€',7:'{[]}\\',14:'â',16:'€',18:'ŧ',21:'ïõ',25:'~ášđǥǧȟ',33:'ǩ',35:'øæž',39:'čǯʒŋµ'},'´`¨');
VirtualKeyboard.addLayout('SE','Swedish',
'§1234567890+´\'qwertyuiopå¨asdfghjklöäzxcvbnm,.-'
,{0:'½!"#¤%&/()=?`*',25:'^',44:';:_'},{2:'@£$€',7:'{[]}\\',16:'€',25:'~',43:'µ'},'´`¨');
VirtualKeyboard.addLayout('CH','Swiss French',
'§1234567890\'^$qwertzuiopè¨asdfghjkléàyxcvbnm,.-'
,{0:'°+"*ç%&/()=?`£',24:'ü!',35:'öä',44:';:_'},{1:'¦@#°§¬|¢',11:'´~}',16:'€',24:'[]',36:'{'},'´^¨');
VirtualKeyboard.addLayout('CH','Swiss German',
'Ö1234567890\'^äqwertzuiopüÜ¨asdfghjklöÄ§$yxcvbnm'
,{0:'É+"*ç%&/()=?`à',24:'èÈ!',36:'éÀ°£'},{0:'¦@#°§¬|¢',11:'´~{',16:'€',24:'[]',39:'}'},'´^¨');
VirtualKeyboard.addLayout('SY','Syriac Phonetic',
'\u070F1234567890-=܆ܩܘܖܪܬܝܜܥܧܦ][ܐܣܕܔܓܗܛܟܠܚܞܙܨܤܫܒܢܡ܀.܇'
,{0:'̮!̥̊݉♰♱܊»)(«+:ܑܱܴܷܻܾܰܳܶܺܽ݀݁̈̄̇̃݊ـ̤̱̣̰ܸܼܹ݂ܲܵܿ،؛؟'},{0:'ّ܁܂܃܄܅܈܉܋܌܍┌┐',14:'ًٌَُ̭ٓٔ݇݃݅',26:'ٍِٖءٰٕ݈݄݆',38:'ْ',40:'\u200D\u200C\u200E\u200F'});
VirtualKeyboard.addLayout('SY','Syriac',
'\u070F1234567890-=܆ܔܨܖܩܦܜܥܗܞܚܓܕܫܣܝܒܠܐܬܢܡܟܛ][ܤܪܧ܀.ܘܙ܇'
,{0:'̮!̥̊݉♰♱܊»)(«+:ܑܱܴܷܻܾܰܳܶܺܽ݀݁̈̄̇̃݊ـ̤̱̣̰ܸܼܹ݂ܲܵܿ،؛؟'},{0:'ّ܁܂܃܄܅܈܉܋܌܍┌┐',14:'ًٌَُ̭ٓٔ݇݃݅',26:'ٍِٖءٰٕ݈݄݆',38:'ْ',40:'\u200D\u200C\u200E\u200F'});
VirtualKeyboard.addLayout('IN','Tamil',
'ொ1234567890-ெௌைாீூபஹகதஜடஞோே்ிுபரகதசடமநவலஸ,.ய .'
,{0:'ஒ',6:'த்ரக்ஷஷ்ர',11:'ஃ',13:'எஔஐஆஈஊ',20:'ங',23:'ச',26:'ஓஏஅஇஉ',32:'ற',37:'ணனழளஷஷஸ்ரீ'},{1:'௧௨௩௪௫௬௭௮௯௰௱௲'});
VirtualKeyboard.addLayout('RU','Tatar',
'һ1234567890-=\\йөукенгшәзхүфывапролдңэячсмитҗбю.'
,{1:'!"№;%:?*()_+/',46:','},{0:'ё',2:'@#$',7:'[]{}',15:'ц',22:'щ',25:'ъ',35:'ж\'',43:'ь<>'});
VirtualKeyboard.addLayout('IN','Telugu',
'ొ1234567890-ృెౌైాీూబహగదజడోే్ిుపరకతచటంమనవలస,.య '
,{0:'ఒ',3:'్ర',5:'జ్ఞత్రక్షశ్ర()ఃఋఎఔఐఆఈఊభఙఘధఝఢఞఓఏఅఇఉఫఱఖథఛఠఁణ',41:'ళశష'},{1:'౧౨౩౪౫౬౭౮౯౦',12:'ౄ',15:'ౖ',27:'ౕ'});
VirtualKeyboard.addLayout('TH','Thai Kedmanee (non-ShiftLock)',
'_ๅ/-ภถุึคตจขชฃๆไำพะัีรนยบลฟหกดเ้่าสวงผปแอิืทมใฝ'
,{0:'%+๑๒๓๔ู฿๕๖๗๘๙ฅ๐"ฎฑธํ๊ณฯญฐ,ฤฆฏโฌ็๋ษศซ.()ฉฮฺ์?ฒฬฦ'});
VirtualKeyboard.addLayout('TH','Thai Kedmanee',
'_ๅ/-ภถุึคตจขชฃๆไำพะัีรนยบลฟหกดเ้่าสวงผปแอิืทมใฝ'
,{0:'%+๑๒๓๔ู฿๕๖๗๘๙ฅ๐"ฎฑธํ๊ณฯญฐ,ฤฆฏโฌ็๋ษศซ.()ฉฮฺ์?ฒฬฦ'});
VirtualKeyboard.addLayout('TH','Thai Pattachote (non-ShiftLock)',
'_=๒๓๔๕ู๗๘๙๐๑๖็ตยอร่ดมวแใฌ้ทงกัีานเไขบปลหิคสะจพ'
,{0:'฿+"/,?ุ_.()-%ํ๊ฤๆญษึฝซถฒฯฦ๋ธำณ์ืผชโฆฑฎฏฐภัศฮฟฉฬ'});
VirtualKeyboard.addLayout('TH','Thai Pattachote',
'_=๒๓๔๕ู๗๘๙๐๑๖็ตยอร่ดมวแใฌ้ทงกัีานเไขบปลหิคสะจพ'
,{0:'฿+"/,?ุ_.()-%ํ๊ฤๆญษึฝซถฒฯฦ๋ธำณ์ืผชโฆฑฎฏฐภัศฮฟฉฬ'});
VirtualKeyboard.addLayout('TH','Thai',
'_ๅ/-ภถุึคตจขชฃๆไำพะัีรนยบลฟหกดเ้่าสวงผปแอิืทมใฝ'
,{0:'%+๑๒๓๔ู฿๕๖๗๘๙ฅ๐"ฎฑธํ๊ณฯญฐมฤฆฏโฌ็๋ษศซใ()ฉฮฺ์?ฒฬฦ'});
VirtualKeyboard.addLayout('TR','Turkish F',
'+1234567890/-xfgğıodrnhpqwuieaütkmlyşjövcçzsb.,'
,{0:'*!"^$%&\'()=?_',27:'İ',45:':;'},{0:'¬¹²#¼½¾{[]}\\|`@',17:'¶',19:'¥',22:'ø£¨~æß€',35:'´',37:'«»¢',43:'µ×÷\u00AD'},'^`¨~´');
VirtualKeyboard.addLayout('TR','Turkish Q',
'"1234567890*-,qwertyuıopğüasdfghjklşizxcvbnmöç.'
,{0:'é!\'^+%&/()=?_;',36:'İ',46:':'},{0:'<>£#$½',7:'{[]}\\|`@',16:'€',24:'¨~æß',35:'´'},'^`¨~´');
VirtualKeyboard.addLayout('GB','United Kingdom Extended',
'`1234567890-=#qwertyuiop[]asdfghjkl;\'zxcvbnm,./'
,{0:'¬!"£$%^&*()_+~',24:'{}',35:':@',44:'<>?'},{0:'¦',2:'¨',4:'€',6:'^',13:'~',15:'ẃé',19:'ýúíó',26:'á',36:'´',39:'ç'},'`¨^~´');
VirtualKeyboard.addLayout('GB','UK Qwerty-Maltron on 102 Keyboard',
'l1234567890-=aqqwpeyrctby[u]ivompu[z]asndifsgfh'
,{1:'!"£$%^&*()_+',25:'{',27:'}',34:'{',36:'}'},{2:'¨',4:'€',6:'^',13:'á',15:'ẃé',23:'ýúíó'},'¨^');
VirtualKeyboard.addLayout('GB','United Kingdom',
'`1234567890-=#qwertyuiop[]asdfghjkl;\'zxcvbnm,./'
,{0:'¬!"£$%^&*()_+~',24:'{}',35:':@',44:'<>?'},{0:'¦',4:'€',16:'é',20:'úíó',26:'á'});
VirtualKeyboard.addLayout('GB','UK International',
'`1234567890-=#qwertyuiop[]asdfghjkl;\'zxcvbnm,./'
,{0:'¬!"£$%^&*()_+~',24:'{}',35:':@',44:'<>?'},{0:'¦¡²³€¤¼½¾‘’¥×',14:'åẃé®þýúíóöªºáßð',34:'ø¶´æ',39:'©',42:'ñµç',46:'¿'},'`"^~\'');
VirtualKeyboard.addLayout('GB','United Kingdom-Dvorak',
'`1234567890-=#/,.pyfgcrl[]aoeuidhtns\';qjkxbmwvz'
,{0:'¬!"£$%^&*()_+~?<>',24:'{}',36:'@:'},{0:'¦',4:'€'});
VirtualKeyboard.addLayout('UA','Ukrainian Translit',
'ё1234567890-ґєяшертiуиопющасдфгчйкльжзхцвбнмї.='
,{1:'!"№;%:?*()_',45:',+'});
VirtualKeyboard.addLayout('UA','Ukrainian',
'ё1234567890-=\\йцукенгшщзхїфівапролджєячсмитьбю.'
,{1:'!"№;%:?*()_+/',46:','},{20:'ґ'});
VirtualKeyboard.addLayout('PK','Urdu',
'`1234567890-=\\طصھدٹپتبجح][مورنلہاکی؛\'قفےسشغع،۔/'
,{0:'~!@#$٪^ۖ٭)(_+|ظضذڈثّۃـچخ}{ژزڑںۂءآگي:"\u200D\u200Cۓ\u200Eؤئ\u200F><؟'});
VirtualKeyboard.addLayout('US','United States-Dvorak for left hand',
'`[]/pfmlj4321\\;qbyurso.65=-kcdtheaz87\'xgvwni,09'
,{0:'~{}?',9:'$#@!|:',22:'>^%+_',35:'*&"',44:'<)('});
VirtualKeyboard.addLayout('US','United States-Dvorak for right hand',
'`1234jlmfp/[]\\56q.orsuyb;=78zaehtdck-90x,inwvg\''
,{0:'~!@#$',10:'?{}|%^',17:'>',24:':+&*',36:'_()',40:'<',46:'"'});
VirtualKeyboard.addLayout('US','United States-Dvorak',
'`1234567890[]\\\',.pyfgcrl/=aoeuidhtns-;qjkxbmwvz'
,{0:'~!@#$%^&*(){}|"<>',24:'?+',36:'_:'});
VirtualKeyboard.addLayout('US','United States-International',
'`1234567890-=\\qwertyuiop[]asdfghjkl;\'zxcvbnm,./'
,{0:'~!@#$%^&*()_+|',24:'{}',35:':"',44:'<>?'},{1:'¡²³¤€¼½¾‘’¥×¬äåé®þüúíóö«»áßð',34:'ø¶´æ',39:'©',42:'ñµç',46:'¿'},'`~^\'');
VirtualKeyboard.addLayout('US','US English',
'p122334456677з890-=qйwцeуrкtеyнuгiшoщ[х]ъaфsыdв'
,{1:'!@"#№$;%^:&?',14:'*()_+',37:'{',39:'}'},{1:'‚©¤€°',10:'¬',15:'¶№–†',22:'є',26:'ћ',30:'ўї',42:'ѕђ'});
VirtualKeyboard.addLayout('US','US',
'`1234567890-=\\qwertyuiop[]asdfghjkl;\'zxcvbnm,./'
,{0:'~!@#$%^&*()_+|',24:'{}',35:':"',44:'<>?'});
VirtualKeyboard.addLayout('UZ','Uzbek Cyrillic',
'ё1234567890ғҳ\\йцукенгшўзхъфқвапролджэячсмитьбю.'
,{1:'!"№;%:?*()',13:'/',46:','});
VirtualKeyboard.addLayout('VN','Vietnamese',
'`ăâêộ̀̉̃́đ-₫\\qwertyuiopươasdfghjkl;\'zxcvbnm,./'
,{0:'~',11:'_+|',35:':"',44:'<>?'},{1:'123456789',12:'=',24:'[]'});
*/